#1 задача:
Есть 90 человек. Каждый из этих 90 человек относится к одной из двух категорий. Одни на все вопросы говорят правду, другие — всегда врут. У каждого ровно 1 любимое блюдо из списка (макароны/пельмени/вареники). Каждому задают три вопроса:
•	Ваше любимое блюдо — макароны?
•	Ваше любимое блюдо — пельмени?
•	Ваше любимое блюдо — вареники?
Результаты получились такие: 
•	на первый вопрос утвердительно ответило 45 человек,
•	на второй — 35,
•	на третий — 30.
Сколько человек всегда говорят правду?

##Решение:
Анкетой предполагается 90 утвердительных ответов. Дано 110 (45+35+30).
Каждый говорящий правду дал один утвердительный ответ.
Каждый солгавший участник дал по 2 утвердительных ответа, один из которых лишний. Отсюда следует, что каждый лишний ответ принадлежит одному участнику опроса. 
Лишних ответов 20 (110-90). Значит солгавших участников столько же. 
Значит из опрошенных сказали правду 70 (90-20)
##Ответ: 70. *(Время выполнения ~5мин)*


#2 задача:
Есть числа от трех до одиннадцати. Есть квадрат — 3 на 3 клетки:
а б в
г д е
ё ж з
(Буквы ничего не значат, кроме того, что числа не повторяются)
Можно ли расставить числа в клетки квадрата таким образом, что перемножения чисел в строках дает тот же результат, что и произведение чисел в столбцах с теми же номерами?
Если можно — расставьте, если нельзя — объясните почему. 

##Решение:
Сравнение происходит между произведениями с одним одинаков множителем. Значит для выполнения условия в 1 случае необходимо чтобы оставшиеся множители попарно имели бы противоположное отношение друг к другу. Т.е. При сравнении строки А*Б*В и столбца А*Г*Ё необходимо, чтобы Б*В = Г*Ё или Б/Г = Ё/В. 
Для выполнения условия во всех 3 случаях необходимо, чтобы было 3 пары чисел с одинаковым отношением.

Т.к. чисел немного, и они не большие эти пары можно увидеть без сложных расчетов:
10/5 = 8/4 = 6/3. Из предоставленного множества чисел остаются 7,9 и 11. Их мы расставим в места пересечения строк и столбцов.

11	10	4
5	9	6
8	3	7

##Ответ: Возможно. *(Время выполнения и доказательства ~10мин)*
